package org.example.algorithm.day05_16;

public class UntilOne {

    /**
     * ## 1 이 될 때까지
     * <p>
     * 어떠한 수 N 이 1 이 될 때까지 다음의 두 과정 중 하나를 반복적으로 선택하여 수행하려고 한다.
     * 단, 두 번째 연산은 N 이 K 로 나누어 떨어질 때만 선택할 수 있다.
     * 1. N 에서 1을 뺀다.
     * 2. N 을 K 로 나눈다.
     * 예를 들어 N 이 17, K 가 4 라고 가정하자. 이때 1 번의 과정을 한 번 수행하면
     * N 은 16 이 된다. 이후에 2 번과정을 두 번 수행하면 N 은 1이 된다. 결과적으로 이 경우
     * 전체 과정을 실행한 횟수는 3 이 된다. 이는 N 을 1로 만드는 최소 횟수이다.
     * <p>
     * N 과 K 가 주어질 때 N 이 1 이 될 때까지 1번 혹은 2번의 과정을 수행해야하는 최소 횟수를
     * 구하는 프로그램을 작성하시오.
     * <p>
     * 입력조건)
     * - 첫째 줄에 N(2 <= N <= 100,000) 과 K(2 <= K <= 100,000) 가 공백으로 구분되며
     * 각각 자연수로 주어진다. 이때 입력으로 주어지는 N 은 항상 K 보다 크거나 같다.
     * <p>
     * 출력조건)
     * - 첫째 줄에 N이 1이 될 때까지 1번 혹은 2번의 과정을 수행해야 하는 횟수의 최솟값을 출력
     * 한다.
     * <p>
     * 입력예시)
     * 25 5
     * <p>
     * 출력예시)
     * 2
     * <p>
     * tip) 최대한 많이 나누기
     */

    public static void main(String[] args) {

        int n = 25;
        int k = 5;
        int cnt = 0;

        for(cnt = 1; n != 1; cnt++){
            if(n % k == 0){
                n /= n;
            }else{
                n--;
            }
        }
        System.out.println(cnt);

    }

}
